{
    "TermOfUse": [
        "Условия использования для приложения AstrologAI",
        "1. Введение",
        "1.1. Настоящее Соглашение является юридическим документом и определяет условия использования мобильного приложения AstrologAI (далее — \"Приложение\") между Вами, далее именуемым \"Пользователь\", и Kutovanov Hennadii, действующим в качестве Индивидуального Предпринимателя (далее — \"Организатор\"), а также любыми лицами, использующими данное Приложение.",
        "2. Описание услуг",
        "2.1. Приложение AstrologAI предоставляет пользователю возможность получения астрологических прогнозов на различные временные интервалы, включая текущий день, неделю и месяц.",
        "2.2. Прогнозы обновляются ежедневно, и время следующего обновления может быть изменено в настройках Приложения.",
        "3. Общие положения и условия использования",
        "3.1. Регистрация и Данные Пользователя: Для полноценного использования функционала приложения AstrologAI необходима предварительная регистрация. В ходе регистрации от Пользователя требуется предоставление следующих данных: никнейм, электронный адрес, гендер, место и время рождения, текущее местоположение и язык общения.",
        "3.2. Дополнительно, по желанию Пользователя, может быть предоставлена краткая биография для улучшения качества предоставляемых услуг.",
        "3.3. Собранные данные будут использованы для предоставления и оптимизации услуг, и хранятся в соответствии с действующим законодательством.",
        "3.4. Приложение разработано для использования широкой аудиторией и не имеет возрастных или иных ограничений, если не указано иное.",
        "4. Оплата и Финансовые Транзакции",
        "4.1. Оплата за доступ к функционалу приложения производится в соответствии с текущими тарифами, указанными в приложении или на официальном веб-сайте.",
        "4.2. Все финансовые транзакции будут подтверждены отправкой электронного чека, квитанции или другого подходящего документа на электронную почту пользователя.",
        "4.3. Все платежи производятся в USD и являются окончательными, не подлежат возврату, за исключением случаев, прямо предусмотренных законодательством.",
        "5. Права на интеллектуальную собственность",
        "5.1. Все материалы и содержание Приложения, включая, но не ограничиваясь, тексты, графику, логотипы и иконки, являются собственностью Kutomanov Hennadii, действующего в качестве Индивидуального Предпринимателя, и защищены международными законами об авторских правах и интеллектуальной собственности.",
        "6. Сбор и использование персональных данных",
        "6.1. Собранные в ходе регистрации и использования приложения AstrologAI персональные данные используются исключительно с целью предоставления и оптимизации астрологических услуг. Возможно применение данных для обучения внутренней астрологической нейронной сети с целью улучшения качества прогнозов.",
        "6.2. Персональные данные Пользователя хранятся в строгом соответствии с действующим законодательством и не подлежат передаче третьим лицам, за исключением случаев, предусмотренных законом.",
        "6.3. Пользователь имеет право на доступ, коррекцию и удаление своих персональных данных. Данные хранятся до момента, пока Пользователь не запросит их удаления или коррекции.",
        "7. Ограничение ответственности ",
        "7.1. Приложение AstrologAI предоставляет астрологические прогнозы исключительно в форме рекомендаций. Несмотря на использование специализированной нейронной сети для анализа, не гарантируется абсолютная точность прогнозов. ",
        "7.2. Точность прогнозов может быть подвергнута различным факторам, включая, но не ограничиваясь, качество данных, предоставленных пользователем, и текущую стадию развития нашей астрологической нейронной сети. ",
        "7.3. С учетом вышеизложенного, мы отказываемся от всех форм юридической ответственности за последствия, возникшие при использовании наших астрологических прогнозов, в пределах, разрешенных применимым законодательством.",
        "8. Права пользователя на персональные данные ",
        "8.1. Пользователь имеет право запросить доступ к своим персональным данным, исправить их или требовать их удаления через настройки приложения или по электронной почте в соответствии с действующим законодательством.",
        "9. Политика отмены и возврата ",
        "9.1. Для отмены подписки на услуги приложения, перейдите в раздел \"Подписки\" в настройках приложения. ",
        "9.2. Возврат оплаченных средств не предусмотрен, исключая случаи, прямо указанные в применимом законодательстве.",
        "10. Изменения в Условиях Использования ",
        "10.1. Мы оставляем за собой право изменять эти Условия Использования. Уведомление о любых таких изменениях будет отправлено через email или другие доступные каналы коммуникации.",
        "11. Контактная информация ",
        "11.1. По всем вопросам, связанным с использованием приложения или данными Условиями, пожалуйста, обращайтесь на электронную почту support@astrologai.com или через настройки в приложении."
    ]
}