{
    "English": {
        "TermOfUse": [
            "Terms of Use for the AstrologAI App",
            "1. Introduction",
            "1.1. This Agreement is a legal document and defines the terms of use of the AstrologAI mobile application (hereinafter referred to as the \"Application\") between you, hereinafter referred to as the \"User\", and Kutomanov Hennadii, acting as an Individual Entrepreneur (hereinafter referred to as the \"Organizer\"), as well as any persons using this Application.",
            "2. Description of services",
            "2.1. The AstrologAI application provides the user with the ability to obtain astrological forecasts for various time intervals, including the current day, week and month.",
            "2.2. Forecasts are updated daily, and the time of the next update can be changed in the Application settings.",
            "3. General terms and conditions of use",
            "3.1. Registration and User Data: To fully use the functionality of the AstrologAI application, prior registration is required. During registration, the User is required to provide the following data: nickname, email address, gender, place and time of birth, current location and language of communication.",
            "3.2. Additionally, at the User's request, a short biography may be provided to improve the quality of the services provided.",
            "3.3. The collected data will be used to provide and optimize services, and will be stored in accordance with applicable law.",
            "3.4. The application is designed for use by a general audience and has no age or other restrictions, unless otherwise stated.",
            "4. Payment and Financial Transactions",
            "4.1. Payment for access to the functionality of the application is made in accordance with the current tariffs indicated in the application or on the official website.",
            "4.2. All financial transactions will be confirmed by sending an electronic check, receipt or other suitable document to the user's email.",
            "4.3. All payments are made in USD and are final and non-refundable, except as expressly provided by law.",
            "5. Intellectual property rights",
            "5.1. All materials and content of the Application, including, but not limited to, texts, graphics, logos and icons, are the property of Kutomanov Hennadii, acting as an Individual Entrepreneur, and are protected by international copyright and intellectual property laws.",
            "6. Collection and use of personal data",
            "6.1. Personal data collected during registration and use of the AstrologAI application is used solely for the purpose of providing and optimizing astrological services. It is possible to use the data for training the internal astrological neural network in order to improve the quality of forecasts.",
            "6.2. The User's personal data is stored in strict accordance with current legislation and is not subject to transfer to third parties, except as required by law.",
            "6.3. The User has the right to access, correction and deletion of his personal data. The data is stored until the User requests its deletion or correction.",
            "7. Limitation of liability",
            "7.1. The AstrologAI application provides astrological forecasts solely in the form of recommendations. Despite the use of a specialized neural network for analysis, the absolute accuracy of the forecasts is not guaranteed.",
            "7.2. The accuracy of predictions may be subject to various factors, including, but not limited to, the quality of data provided by the user and the current stage of development of our astrological neural network.",
            "7.3. Subject to the foregoing, we disclaim all forms of legal liability for consequences arising from the use of our astrological forecasts, to the extent permitted by applicable law.",
            "8. User rights to personal data",
            "8.1. The user has the right to request access to his personal data, correct it or demand its deletion through the application settings or by email in accordance with applicable law.",
            "9. Cancellation and Return Policy",
            "9.1. To cancel your subscription to application services, go to the \"Subscriptions\" section in the application settings.",
            "9.2. Refunds of paid funds are not provided, except in cases expressly specified in the applicable law.",
            "10. Changes to the Terms of Use",
            "10.1. We reserve the right to change these Terms of Use. Notice of any such changes will be sent via email or other available communication channels.",
            "11. Contact information",
            "11.1. For any questions related to the use of the application or these Terms, please contact support@astrologai.com or through the settings in the application."
        ]
    },
    "Русский": {
        "TermOfUse": [
            "Условия использования для приложения AstrologAI",
            "1. Введение",
            "1.1. Настоящее Соглашение является юридическим дументом и определяет условия использования мобильного приложения AstrologAI (далее — \"Приложение\") между Вами, далее именуемым \"Пользователь\", и Kutomanov Hennadii, действующим в качестве Индивидуального Предпринимателя (далее — \"Организатор\"), а также любыми лицами, использующими данное Приложение.",
            "2. Описание услуг",
            "2.1. Приложение AstrologAI предоставляет пользователю возможность получения астрологических прогнозов на различные временные интервалы, включая текущий день, неделю и месяц.",
            "2.2. Прогнозы обновляются ежедневно, и время следующего обновления может быть изменено в настройках Приложения.",
            "3. Общие положения и условия использования",
            "3.1. Регистрация и Данные Пользователя: Для полноценного использования функционала приложения AstrologAI необходима предварительная регистрация. В ходе регистрации от Пользователя требуется предоставление следующих данных: никнейм, электронный адрес, гендер, место и время рождения, текущее местоположение и язык общения.",
            "3.2. Дополнительно, по желанию Пользователя, может быть предоставлена краткая биография для улучшения качества предоставляемых услуг.",
            "3.3. Собранные данные будут использованы для предоставления и оптимизации услуг, и хранятся в соответствии с действующим законодательством.",
            "3.4. Приложение разработано для использования широкой аудиторией и не имеет возрастных или иных ограничений, если не указано иное.",
            "4. Оплата и Финансовые Транзакции",
            "4.1. Оплата за доступ к функционалу приложения производится в соответствии с текущими тарифами, указанными в приложении или на официальном веб-сайте.",
            "4.2. Все финансовые транзакции будут подтверждены отправкой электронного чека, квитанции или другого подходящего документа на электронную почту пользователя.",
            "4.3. Все платежи производятся в USD и являются окончательными, не подлежат возврату, за исключением случаев, прямо предусмотренных законодательством.",
            "5. Права на интеллектуальную собственность",
            "5.1. Все материалы и содержание Приложения, включая, но не ограничиваясь, тексты, графику, логотипы и иконки, являются собственностью Kutomanov Hennadii, действующего в качестве Индивидуального Предпринимателя, и защищены международными законами об авторских правах и интеллектуальной собственности.",
            "6. Сбор и использование персональных данных",
            "6.1. Собранные в ходе регистрации и использования приложения AstrologAI персональные данные используются исключительно с целью предоставления и оптимизации астрологических услуг. Возможно применение данных для обучения внутренней астрологической нейронной сети с целью улучшения качества прогнозов.",
            "6.2. Персональные данные Пользователя хранятся в строгом соответствии с действующим законодательством и не подлежат передаче третьим лицам, за исключением случаев, предусмотренных законом.",
            "6.3. Пользователь имеет право на доступ, коррекцию и удаление своих персональных данных. Данные хранятся до момента, пока Пользователь не запросит их удаления или коррекции.",
            "7. Ограничение ответственности ",
            "7.1. Приложение AstrologAI предоставляет астрологические прогнозы исключительно в форме рекомендаций. Несмотря на использование специализированной нейронной сети для анализа, не гарантируется абсолютная точность прогнозов. ",
            "7.2. Точность прогнозов может быть подвергнута различным факторам, включая, но не ограничиваясь, качество данных, предоставленных пользователем, и текущую стадию развития нашей астрологической нейронной сети. ",
            "7.3. С учетом вышеизложенного, мы отказываемся от всех форм юридической ответственности за последствия, возникшие при использовании наших астрологических прогнозов, в пределах, разрешенных применимым законодательством.",
            "8. Права пользователя на персональные данные ",
            "8.1. Пользователь имеет право запросить доступ к своим персональным данным, исправить их или требовать их удаления через настройки приложения или по электронной почте в соответствии с действующим законодательством.",
            "9. Политика отмены и возврата ",
            "9.1. Для отмены подписки на услуги приложения, перейдите в раздел \"Подписки\" в настройках приложения. ",
            "9.2. Возврат оплаченных средств не предусмотрен, исключая случаи, прямо указанные в применимом законодательстве.",
            "10. Изменения в Условиях Использования ",
            "10.1. Мы оставляем за собой право изменять эти Условия Использования. Уведомление о любых таких изменениях будет отправлено через email или другие доступные каналы коммуникации.",
            "11. Контактная информация ",
            "11.1. По всем вопросам, связанным с использованием приложения или данными Условиями, пожалуйста, обращайтесь на электронную почту support@astrologai.com или через настройки в приложении."
        ]
    },
    "Український": {
        "TermOfUse": [
            "Умови використання для програми AstrologAI",
            "1. Введення",
            "1.1. Ця Угода є юридичним дументом і визначає умови використання мобільного додатка AstrologAI (далі - \"Додаток\") між Вами, далі іменованим \"Користувач\", та Kutomanov Hennadii, що діє як Індивідуальний Підприємець (далі - \"Організатор\"), а також будь-якими особами, які використовують цей Додаток.",
            "2. Опис послуг",
            "2.1. Додаток AstrologAI надає користувачеві можливість отримання астрологічних прогнозів на різні часові інтервали, включаючи поточний день, тиждень та місяць.",
            "2.2. Прогнози оновлюються щодня, і час наступного оновлення може бути змінений у налаштуваннях Програми.",
            "3. Загальні положення та умови використання",
            "3.1. Реєстрація та Дані Користувача: Для повноцінного використання функціонала програми AstrologAI необхідна попередня реєстрація. Під час реєстрації від Користувача потрібно надати наступні дані: нікнейм, електронну адресу, ґендер, місце та час народження, поточне місцезнаходження та мову спілкування.",
            "3.2. Додатково, за бажанням Користувача, може бути надана коротка біографія для покращення якості послуг, що надаються.",
            "3.3. Зібрані дані будуть використані для надання та оптимізації послуг, та зберігаються відповідно до чинного законодавства.",
            "3.4. Додаток розроблено для використання широкою аудиторією та не має вікових чи інших обмежень, якщо не зазначено інше.",
            "4. Оплата та Фінансові транзакції",
            "4.1. Оплата за доступ до функціонала програми провадиться відповідно до поточних тарифів, зазначених у додатку або на офіційному веб-сайті.",
            "4.2. Усі фінансові транзакції будуть підтверджені надсиланням електронного чека, квитанції або іншого відповідного документа на електронну пошту користувача.",
            "4.3. Усі платежі здійснюються в USD і є остаточними, не підлягають поверненню, за винятком випадків, прямо передбачених законодавством.",
            "5. Права на інтелектуальну власність",
            "5.1. Всі матеріали та зміст Додатка, включаючи, але не обмежуючись, тексти, графіку, логотипи та іконки, є власністю Kutomanov Hennadii, що діє як Індивідуальний Підприємець, і захищені міжнародними законами про авторські права та інтелектуальну власність.",
            "6. Збір та використання персональних даних",
            "6.1. Зібрані під час реєстрації та використання програми AstrologAI персональні дані використовуються виключно з метою надання та оптимізації астрологічних послуг. Можливе застосування даних для навчання внутрішньої астрологічної нейронної мережі з метою покращення якості прогнозів.",
            "6.2. Персональні дані Користувача зберігаються у суворій відповідності до чинного законодавства і не підлягають передачі третім особам, за винятком випадків, передбачених законом.",
            "6.3. Користувач має право на доступ, корекцію та видалення своїх персональних даних. Дані зберігаються до того часу, поки Користувач не запросить їх видалення або корекції.",
            "7. Обмеження відповідальності",
            "7.1. Додаток AstrologAI надає астрологічні прогнози виключно у формі рекомендацій. Незважаючи на використання спеціалізованої нейронної мережі для аналізу, не гарантується абсолютна точність прогнозів.",
            "7.2. Точність прогнозів може бути піддана різним факторам, включаючи, але не обмежуючись, якість даних, наданих користувачем, та поточну стадію розвитку нашої астрологічної нейронної мережі.",
            "7.3. З урахуванням вищевикладеного, ми відмовляємося від усіх форм юридичної відповідальності за наслідки, що виникли при використанні наших астрологічних прогнозів, у межах, дозволених чинним законодавством.",
            "8. Права користувача на персональні дані",
            "8.1. Користувач має право запросити доступ до своїх персональних даних, виправити їх або вимагати їх видалення через налаштування програми або електронною поштою відповідно до чинного законодавства.",
            "9. Політика скасування та повернення",
            "9.1. Щоб скасувати підписку на послуги програми, перейдіть до розділу \"Підписки\" в налаштуваннях програми. ",
            "9.2. Повернення сплачених коштів не передбачено, крім випадків, прямо зазначених у застосовному законодавстві.",
            "10. Зміни в Умовах Використання",
            "10.1. Ми залишаємо за собою право змінювати ці Умови використання. Повідомлення про будь-які такі зміни буде надіслано через email або інші доступні канали комунікації.",
            "11. Контактна інформація",
            "11.1. З усіх питань, пов'язаних з використанням програми або цими Умовами, будь ласка, звертайтесь на електронну пошту support@astrologai.com або через налаштування в програмі."
        ]
    }
}